src/Catalogs/Scan_СоглашенияОПоставке/Scan_СоглашенияОПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СоглашенияОПоставке</name>
  <basedOn>Catalog.Scan_СоглашенияОПоставке</basedOn>
  <basedOn>Catalog.Scan_СпециальныеУсловия</basedOn>
  <attributes>
    <name>DDS</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FFU</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>IDПродуктаКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SORDER</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческоеПредложениеSPORT</name>
    <type>
      <types>CatalogRef.Scan_КоммерческиеПредложения</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиентКомпания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузовостроитель</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоПродукту</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORTДляЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСОП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Scan_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецДилера</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РегиональныйМенеджер</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныеУсловия</name>
    <type>
      <types>CatalogRef.Scan_СпециальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартнаяСпецификация</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.Scan_ТипыСтатусовЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоглашенияОПоставке</name>
    <type>
      <types>EnumRef.Scan_ТипыСоглашенийОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальностьСпецификации</name>
    <type>
      <types>EnumRef.Scan_ТипыСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветКабины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФальшрадиаторнойРешетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСоглашенияОПоставке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяРазмещениеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявкиНаСОПSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДилераSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийSRUSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаБУПродукты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийИзУТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрепленныйМенеджерОКП</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютнаяОговорка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаАвтобусы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаРезерв</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходнаяЗаявка</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УсловияОплаты</name>
    <attributes>
      <name>ПроцентОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокОплатыАванса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетДатыОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыРасчетаДатыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПродуктов</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
        <types>CatalogRef.Scan_ДрафтыПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентДрайв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпециальныеУсловия</name>
      <type>
        <types>CatalogRef.Scan_СпециальныеУсловия</types>
      </type>
    </attributes>
    <attributes>
      <name>DDЗапрошенная</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DDS</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладОтгрузки</name>
      <type>
        <types>CatalogRef.Scan_Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Драйв</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоВалютнойОговорке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПерерасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикПлатежей</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_СоглашенияОПоставке/Forms/ФормаНастройкиКорректировки/Module.bsl
//rarus vikhle 04.08.2020 mt 16181 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если НЕ Параметры.Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ПроектЗаявкиНаСОП Тогда
	//	 Элементы.Цены.Видимость = Ложь;
	//КонецЕсли;
	//Элементы.Цены.Видимость = Параметры.РольИсполнителя = Справочники.РолиИсполнителей.  
	
	//rarus vikhle 28.02.2021 mt 17186 +++
	Если Параметры.Свойство("РольИсполнителя") Тогда 
		Если Параметры.РольИсполнителя = Справочники.РолиИсполнителей.НайтиПоНаименованию("Дилер") Тогда
			Элементы.УсловияОплаты.Видимость	= Ложь;
			Элементы.РазделениеЗаявки.Видимость = Ложь; //rarus vikhle 29.09.2021 mt 18076
		Иначе
			Элементы.ОбщиеДанныеЗаявки.Видимость = Ложь; //rarus vikhle 24.05.2021 m 17653
		КонецЕсли;
		
		// rarus kabany 13.07.2021 17992 ++
		//rarus vikhle 25.05.2021 m 17653 +++
		//Если Параметры.Свойство("Статус")
		//	И НЕ Параметры.Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.НачатоОформлениеСОП
		//	И НЕ Параметры.Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_Оформлен Тогда
		//	Элементы.ОбщиеДанныеЗаявки.ТолькоПросмотр = Истина;
		//КонецЕсли;
		//rarus vikhle 25.05.2021 m 17653 ---
		
		СтатусПодходитОКП = Ложь;
		Если Параметры.Свойство("Статус") Тогда
			
			// rarus vikhle 11.10.2021 m 18364 +++
			Если Параметры.Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ЗапросНаИзменениеСОП Тогда
				СтатусЗаявкиНаСОП = Справочники.Scan_СоглашенияОПоставке.ПолучитьСтатусДоЗапросаИзменений(Параметры.Ссылка);	
			Иначе	
				СтатусЗаявкиНаСОП = Параметры.Статус; 
			КонецЕсли;
			// rarus vikhle 11.10.2021 m 18364 ---
			
			Если //СтатусЗаявкиНаСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.НачатоОформлениеСОП // rarus vikhle 11.10.2021 m 18364
				СтатусЗаявкиНаСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_Оформлен
				ИЛИ СтатусЗаявкиНаСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_ИсполненЧастично Тогда //rarus vikhle 12.08.2021 m 18147
				СтатусПодходитОКП = Истина;
			// rarus vikhle 11.10.2021 m 18364 +++
			//Иначе
			//	Элементы.ОбщиеДанныеЗаявки.ТолькоПросмотр = Истина;	
			// rarus vikhle 11.10.2021 m 18364 ---
			КонецЕсли;
		
		    // rarus vikhle 11.10.2021 m 18364 +++
			Если НЕ (СтатусЗаявкиНаСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.НачатоОформлениеСОП
				ИЛИ СтатусЗаявкиНаСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_Оформлен
				ИЛИ СтатусЗаявкиНаСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_ИсполненЧастично) Тогда
				Элементы.ОбщиеДанныеЗаявки.ТолькоПросмотр = Истина;
			КонецЕсли;	
			// rarus vikhle 11.10.2021 m 18364 ---
		
		КонецЕсли;		
		// rarus kabany 13.07.2021 17992 --
		
		//Элементы.Сроки.Видимость = Параметры.РольИсполнителя = Справочники.РолиИсполнителей.НайтиПоНаименованию("Сотрудник отдела клиентской поддержки") //rarus vikhle 01.04.2021 mt 17472	
		//rarus vikhle 26.05.2021 m 17780 +++
		НаименованиеРоли = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.РольИсполнителя,"Наименование"));
		Если НаименованиеРоли = "Сотрудник отдела клиентской поддержки" ИЛИ НаименованиеРоли = "Руководитель отдела клиентской поддержки" Тогда
			Элементы.Сроки.Видимость = Истина;
			// rarus kabany 13.07.2021 17992 ++
			Элементы.ИзменитьУсловияДоговора.Видимость = ?(СтатусПодходитОКП, Истина, Ложь);
			// rarus kabany 13.07.2021 17992 --
		Иначе
			Элементы.ИзменитьУсловияДоговора.Видимость = Ложь;			
			Элементы.Сроки.Видимость = Ложь; // rarus kabany 13.07.2021 17992 +
		КонецЕсли;
		//rarus vikhle 26.05.2021 m 17780 ---
	КонецЕсли;	
	//rarus vikhle 28.02.2021 mt 17186 ---
			
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Если НЕ Состав 
		И НЕ Цены 
		И НЕ Условия 
		И НЕ Сроки //rarus vikhle 01.04.2021 mt 17472 добавил сроки 
		И НЕ ОбщиеДанныеЗаявки //24.05.2021 vikhle 17653 + общиеданные.. 
		И НЕ ИзменитьУсловияДоговора // rarus kabany 13.07.2021 17992 ++ добавил ИзменитьУсловияДоговора 
		И НЕ РазделениеЗаявки //rarus vikhle 29.09.2021 mt 18076
		Тогда
		ОчиститьСообщения();
		Сообщить(Нстр("ru = 'Не выбран тип корректировки.'; en = 'Choose adjustment type'"));
	Иначе	
		//rarus vikhle 29.09.2021 mt 18076 +++
		//ПараметрыЗакрытия = Новый Структура("Условия,Состав,Цены,Сроки,ОбщиеДанныеЗаявки,ИзменитьУсловияДоговора",Условия,Состав,Цены,Сроки,ОбщиеДанныеЗаявки,ИзменитьУсловияДоговора); //rarus vikhle 01.04.2021 mt 17472 добавил сроки 24.05.2021 vikhle 17653 + общиеданные.. // rarus kabany 13.07.2021 17992 ++ добавил ИзменитьУсловияДоговора 
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("Условия", Условия);
		ПараметрыЗакрытия.Вставить("Состав", Состав);
		ПараметрыЗакрытия.Вставить("Цены", Цены);
		ПараметрыЗакрытия.Вставить("Сроки", Сроки);
		ПараметрыЗакрытия.Вставить("ОбщиеДанныеЗаявки", ОбщиеДанныеЗаявки);
		ПараметрыЗакрытия.Вставить("ИзменитьУсловияДоговора", ИзменитьУсловияДоговора);
		ПараметрыЗакрытия.Вставить("РазделениеЗаявки", РазделениеЗаявки);
		//rarus vikhle 29.09.2021 mt 18076 ---
		Закрыть(ПараметрыЗакрытия);	
	КонецЕсли;	
КонецПроцедуры
//rarus vikhle 04.08.2020 mt 16181 +++
